In [3]:
import pandas as pd
import numpy as np

a = pd.Series([3,5,8,9,1])

In [4]:
a

0    3
1    5
2    8
3    9
4    1
dtype: int64

In [5]:
a.values

array([3, 5, 8, 9, 1])

In [6]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
b = pd.Series([1,9,7,6,5], index=['a','b','c','d','e'])
b

a    1
b    9
c    7
d    6
e    5
dtype: int64

In [10]:
b[['a','d']]

a    1
d    6
dtype: int64

In [11]:
ob = pd.Series([5,6,-9,3,-1,10,0,-32])
ob[ob > 0]

0     5
1     6
3     3
5    10
dtype: int64

In [12]:
ob * 2

0    10
1    12
2   -18
3     6
4    -2
5    20
6     0
7   -64
dtype: int64

In [14]:
dict = {'india':2, 'china':1, 'usa':7, 'africa':5}
d = pd.Series(dict)
d

india     2
china     1
usa       7
africa    5
dtype: int64

In [16]:
data = {'breakfast':[9, 7, 9, 8], 'lunch':[12, 12, 11, 1],'dinner':[7,6,8,8]}
f = pd.DataFrame(data, index=['mom','dad','santo','geega'])
f

       breakfast  lunch  dinner
mom            9     12       7
dad            7     12       6
santo          9     11       8
geega          8      1       8

In [17]:
f['lunch']

mom      12
dad      12
santo    11
geega     1
Name: lunch, dtype: int64

In [18]:
f.lunch

mom      12
dad      12
santo    11
geega     1
Name: lunch, dtype: int64

In [22]:
f.iloc[2]

breakfast     9
lunch        11
dinner        8
Name: santo, dtype: int64

In [23]:
f.loc['mom']

breakfast     9
lunch        12
dinner        7
Name: mom, dtype: int64

In [24]:
f['snacks'] = 5
f

       breakfast  lunch  dinner  snacks
mom            9     12       7       5
dad            7     12       6       5
santo          9     11       8       5
geega          8      1       8       5

In [25]:
del f['snacks']
f

       breakfast  lunch  dinner
mom            9     12       7
dad            7     12       6
santo          9     11       8
geega          8      1       8

In [26]:
f.columns

Index(['breakfast', 'lunch', 'dinner'], dtype='object')

In [27]:
f.index

Index(['mom', 'dad', 'santo', 'geega'], dtype='object')

In [34]:
a = pd.Series([8,50,-32,10,69])
a

0     8
1    50
2   -32
3    10
4    69
dtype: int64

In [36]:
b= a.reindex([1,4,3,2,0])
b

1    50
4    69
3    10
2   -32
0     8
dtype: int64

In [37]:
# Data Frames using 2D arrays:

In [40]:
a = pd.DataFrame(np.arange(36).reshape((6,6)), index=['a','b','c','d','e','f'], columns=[100,200,300,400,500,600])
a

   100  200  300  400  500  600
a    0    1    2    3    4    5
b    6    7    8    9   10   11
c   12   13   14   15   16   17
d   18   19   20   21   22   23
e   24   25   26   27   28   29
f   30   31   32   33   34   35

In [42]:
a2 = a.reindex(['b','c','e'])
a2

   100  200  300  400  500  600
b    6    7    8    9   10   11
c   12   13   14   15   16   17
e   24   25   26   27   28   29

In [44]:
a2.drop('c')

   100  200  300  400  500  600
b    6    7    8    9   10   11
e   24   25   26   27   28   29

In [45]:
a

   100  200  300  400  500  600
a    0    1    2    3    4    5
b    6    7    8    9   10   11
c   12   13   14   15   16   17
d   18   19   20   21   22   23
e   24   25   26   27   28   29
f   30   31   32   33   34   35

In [47]:
a[a[400] > 16]              # selecting data with boolean array

   100  200  300  400  500  600
d   18   19   20   21   22   23
e   24   25   26   27   28   29
f   30   31   32   33   34   35

In [48]:
a

   100  200  300  400  500  600
a    0    1    2    3    4    5
b    6    7    8    9   10   11
c   12   13   14   15   16   17
d   18   19   20   21   22   23
e   24   25   26   27   28   29
f   30   31   32   33   34   35

In [50]:
a.loc[200, ['a','d','f']]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [200] of <class 'int'>

In [51]:
a.iloc[3, [3,0,1]]

400    21
100    18
200    19
Name: d, dtype: int64

In [52]:
a

   100  200  300  400  500  600
a    0    1    2    3    4    5
b    6    7    8    9   10   11
c   12   13   14   15   16   17
d   18   19   20   21   22   23
e   24   25   26   27   28   29
f   30   31   32   33   34   35

In [53]:
a.loc['a', [100,400,500]]

100    0
400    3
500    4
Name: a, dtype: int64

In [55]:
a.iloc[[1,3,4],[3,4]]

   400  500
b    9   10
d   21   22
e   27   28

In [56]:
s = pd.Series([-3,8,9,-9,7,4,-1])
s

0   -3
1    8
2    9
3   -9
4    7
5    4
6   -1
dtype: int64

In [60]:
s.where(s > 0, 1)       # where is actually of numpy and shall be used there, ex- np.where(a>0,1,-1)

0    1
1    8
2    9
3    1
4    7
5    4
6    1
dtype: int64

In [62]:
df1 = pd.DataFrame(np.arange(24).reshape(4,6), columns=list('abcdef') )
df1

    a   b   c   d   e   f
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23

In [64]:
df2 = pd.DataFrame(np.arange(15).reshape(3,5), columns=list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [82]:
df2.loc[0,'c'] = np.nan

In [83]:
df1 + df2

      a     b     c     d     e   f
0   0.0   2.0   NaN   6.0   8.0 NaN
1  11.0  13.0   NaN  17.0  19.0 NaN
2  22.0  24.0  23.0  28.0  30.0 NaN
3   NaN   NaN   NaN   NaN   NaN NaN

In [84]:
df2.loc[2,'c']

9.0

In [86]:
df2

    a   b    c   d   e
0   0   1  NaN   3   4
1   5   6  NaN   8   9
2  10  11  9.0  13  14

In [88]:
df1.add(df2, fill_value=0)      # wherever there is NaN, it will put 0 while adding

      a     b     c     d     e     f
0   0.0   2.0   2.0   6.0   8.0   5.0
1  11.0  13.0   8.0  17.0  19.0  11.0
2  22.0  24.0  23.0  28.0  30.0  17.0
3  18.0  19.0  20.0  21.0  22.0  23.0

In [92]:
arr = pd.DataFrame(np.arange(9).reshape(3,3), columns=list('abc'))
arr

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [96]:
arr['a']

0    0
1    3
2    6
Name: a, dtype: int64

In [99]:
arr - arr.loc[0]           # Broadcasting because the array(arr.loc[0]) got subtracted from all of the rows

   a  b  c
0  0  0  0
1  3  3  3
2  6  6  6

In [100]:
arr

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [107]:
arr.max(axis=1)

0    2
1    5
2    8
dtype: int64

In [109]:
arr.sort_index(axis=1)

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [114]:
arr2 = pd.DataFrame(np.array([2,7,5,4,1,9]).reshape((2,3)), columns=list('abc'))
arr2

   a  b  c
0  2  7  5
1  4  1  9

In [118]:
arr2.sort_index(axis=0)

   a  b  c
0  2  7  5
1  4  1  9

In [119]:
arr2

   a  b  c
0  2  7  5
1  4  1  9

In [121]:
arr2.sum(axis=0)   #same as arr2.sum() or arr2.sum(axis='row')

a     6
b     8
c    14
dtype: int64

In [122]:
arr2.sum(axis=1)   #same as arr2.sum(axis='column')

0    14
1    14
dtype: int64

In [123]:
arr2

   a  b  c
0  2  7  5
1  4  1  9

In [129]:
arr

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [130]:
arr[1:3]

   a  b  c
1  3  4  5
2  6  7  8

In [131]:
arr.loc[1:3]

   a  b  c
1  3  4  5
2  6  7  8

In [132]:
arr.loc[[2,1]]

   a  b  c
2  6  7  8
1  3  4  5

In [133]:
arr[['c','a']]

   c  a
0  2  0
1  5  3
2  8  6

In [134]:
arr['c'].max()

8

In [135]:
arr.describe()          # prints the statistics for all the columns having integer data

         a    b    c
count  3.0  3.0  3.0
mean   3.0  4.0  5.0
std    3.0  3.0  3.0
min    0.0  1.0  2.0
25%    1.5  2.5  3.5
50%    3.0  4.0  5.0
75%    4.5  5.5  6.5
max    6.0  7.0  8.0

In [136]:
arr

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [138]:
arr[arr['c'] == arr['c'].max()]

   a  b  c
2  6  7  8

In [140]:
arr[['a', 'c']][arr['c'] == arr['c'].max()]

   a  c
2  6  8

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
a=10
a

In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('zoo.csv')
df

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [7]:
df['animal'][df['water_need'] == df['water_need'].max()]

1     elephant
16        lion
Name: animal, dtype: object

In [8]:
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [9]:
df.shape

(22, 3)

In [10]:
df.animal

0     elephant
1     elephant
2     elephant
3        tiger
4        tiger
5        tiger
6        tiger
7        tiger
8        zebra
9        zebra
10       zebra
11       zebra
12       zebra
13       zebra
14       zebra
15        lion
16        lion
17        lion
18        lion
19    kangaroo
20    kangaroo
21    kangaroo
Name: animal, dtype: object

In [11]:
df['animal']

0     elephant
1     elephant
2     elephant
3        tiger
4        tiger
5        tiger
6        tiger
7        tiger
8        zebra
9        zebra
10       zebra
11       zebra
12       zebra
13       zebra
14       zebra
15        lion
16        lion
17        lion
18        lion
19    kangaroo
20    kangaroo
21    kangaroo
Name: animal, dtype: object

In [13]:
type(df['animal'])

pandas.core.series.Series

In [14]:
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [16]:
df[2:4][['animal','uniq_id']]

     animal  uniq_id
2  elephant     1003
3     tiger     1004

In [18]:
df[['animal','uniq_id']][2:4]

     animal  uniq_id
2  elephant     1003
3     tiger     1004

In [20]:
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [34]:
df.reset_index(inplace=True)

In [35]:
df

    uniq_id    animal  water_need
0      1001  elephant         500
1      1002  elephant         600
2      1003  elephant         550
3      1004     tiger         300
4      1005     tiger         320
5      1006     tiger         330
6      1007     tiger         290
7      1008     tiger         310
8      1009     zebra         200
9      1010     zebra         220
10     1011     zebra         240
11     1012     zebra         230
12     1013     zebra         220
13     1014     zebra         100
14     1015     zebra          80
15     1016      lion         420
16     1017      lion         600
17     1018      lion         500
18     1019      lion         390
19     1020  kangaroo         410
20     1021  kangaroo         430
21     1022  kangaroo         410

In [40]:
df.set_index('uniq_id',inplace=True)

In [41]:
df

           animal  water_need
uniq_id
1001     elephant         500
1002     elephant         600
1003     elephant         550
1004        tiger         300
1005        tiger         320
1006        tiger         330
1007        tiger         290
1008        tiger         310
1009        zebra         200
1010        zebra         220
1011        zebra         240
1012        zebra         230
1013        zebra         220
1014        zebra         100
1015        zebra          80
1016         lion         420
1017         lion         600
1018         lion         500
1019         lion         390
1020     kangaroo         410
1021     kangaroo         430
1022     kangaroo         410

In [43]:
df.loc[1016]

animal        lion
water_need     420
Name: 1016, dtype: object